Tekla Open API Reference for Tekla Structures 2025
BoltAttributes Properties
The Bolt.BoltAttributes type exposes the following members.
Properties
Name | Description
Color
 The color of the bolt.
CustomPresentation
 Custom presentation GUID to be applied to the bolt
Representation
 The representation type of the bolt.
SymbolContainsAxis
 True if the bolt symbol contains an axis.
SymbolContainsHole
 True if the bolt symbol contains a hole.
TrueColor
 The true color (RGB enabled) of the bolt.
Top
See Also
Reference
Bolt.BoltAttributes Class
Tekla.Structures.Drawing Namespace